# Arithmetic Operations in Pandas

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to show arithmetic operations in Pandas.
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [3]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int64
a    0
c    1
e    2
f    3
g    4
dtype: int64

In [4]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [5]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [6]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [7]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [9]:
# onde um DataFrame tem um valor e o outro tem NaN (valor ausente), o NaN √© temporariamente substitu√≠do pelo fill_value (0, neste caso)
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [10]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [11]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [12]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [13]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [14]:
# DDeprecationWarning
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int64

In [15]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [22]:
s2=df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int64

In [23]:
df2.sub(s2,axis="index")

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

## Applying a Function

In [37]:
# np.random.randn(4, 3): Esta parte usa a biblioteca NumPy para gerar um array de 4 linhas por 3 colunas, preenchido com n√∫meros aleat√≥rios 
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim   -0.954175  0.699014 -0.553555
Susan -3.331521  0.888050  1.014918
Tim    0.586431  0.074875  1.129752
Tom    0.263642  0.421800 -1.220609

In [33]:
np.abs(df)

              A         B         C
Kim    0.386655  0.484509  0.392191
Susan  1.527039  0.696595  0.614399
Tim    0.604469  0.711798  1.715246
Tom    0.706539  1.021809  1.644304

In [36]:
# Fun√ß√£o Lambda
f=lambda x:x.max()-x.min()

In [38]:
df.apply(f)

A    3.917952
B    0.813175
C    2.350360
dtype: float64

In [40]:
df.apply(f,axis=1)

Kim      1.653188
Susan    4.346440
Tim      1.054877
Tom      1.642408
dtype: float64

In [22]:
def f(x):
    return x**2

In [23]:
df.apply(f)

              A         B         C
Kim    0.030178  1.269942  0.354075
Susan  0.411743  0.005463  3.343735
Tim    0.151417  3.190294  0.306524
Tom    0.003898  0.063470  0.761066

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé